---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLinkDocumentExportScope.#ctor(Autodesk.Revit.DB.Document)
source: html/470f48d1-3c33-0174-8b39-bd5fa5d66771.htm
---
# Autodesk.Revit.DB.IFC.IFCLinkDocumentExportScope.#ctor Method

Instantiates a default IFCLinkDocumentExportScope object.

## Syntax (C#)
```csharp
public IFCLinkDocumentExportScope(
	Document pADoc
)
```

## Parameters
- **pADoc** (`Autodesk.Revit.DB.Document`) - The linked document to export.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null